In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('./stock-data.csv')

In [4]:
df.head()

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB

In [23]:
df['new_Date']=pd.to_datetime(df['Date'])

In [24]:
df.head()

                  Date  Close  Start   High    Low  Volume   new_Date
new_Date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
2018-06-29  2018-06-29  10700  10550  10900   9990  170253 2018-06-29
2018-06-28  2018-06-28  10400  10900  10950  10150  155769 2018-06-28
2018-06-27  2018-06-27  10900  10800  11050  10500  133548 2018-06-27
2018-06-26  2018-06-26  10800  10900  11000  10700   63039 2018-06-26

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.2+ KB

In [19]:
type(df['new_Date'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [25]:
df.set_index('new_Date',inplace=True)

In [26]:
df.drop('Date',axis=1,inplace=True)

In [27]:
df.head()

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

In [31]:
df=df.sort_index()

In [34]:
df.loc['2018-07']

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977

In [35]:
df.loc['2018-06-15':'2018-06-30']

            Close  Start   High    Low  Volume
new_Date
2018-06-15  13400  13600  13600  12900  201376
2018-06-18  12000  13400  13400  12000  309787
2018-06-19  11300  11850  11950  11300  180656
2018-06-20  11550  11200  11600  10900  308596
2018-06-21  11200  11350  11750  11200  133002
2018-06-22  11300  11250  11450  10750  134805
2018-06-25  11150  11400  11450  11000   55519
2018-06-26  10800  10900  11000  10700   63039
2018-06-27  10900  10800  11050  10500  133548
2018-06-28  10400  10900  10950  10150  155769
2018-06-29  10700  10550  10900   9990  170253

In [36]:
dates = ['2019-01-01', '2020-03-01', '2021-06-01']

In [37]:
ts_dates=pd.to_datetime(dates)

In [38]:
ts_dates

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [40]:
pr_day=ts_dates.to_period(freq='D')
pr_day

PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')

In [41]:
pr_month=ts_dates.to_period(freq='M')
pr_month

PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')

In [44]:
pr_year=ts_dates.to_period(freq='A')
pr_year

PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

In [45]:
ts_ms=pd.date_range(start='2019-01-01',end=None,periods=6,
                   freq='MS',tz='Asia/Seoul')

In [46]:
ts_ms

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [47]:
ts_me=pd.date_range(start='2019-01-01',end=None,periods=6,
                   freq='M',tz='Asia/Seoul')

In [48]:
ts_me

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')

In [49]:
ts_3m=pd.date_range(start='2019-01-01',end=None,periods=6,
                   freq='3M',tz='Asia/Seoul')

In [50]:
ts_3m

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

In [51]:
pr_m=pd.period_range(start='2019-01-01', end=None,
                    periods=3, freq='M')

In [52]:
pr_m

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]')

In [53]:
pr_h=pd.period_range(start='2019-01-01',end=None,
                    periods=3,freq='H')

In [54]:
pr_h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00'], dtype='period[H]')

In [55]:
pr_2h=pd.period_range(start='2019-01-01',end=None,
                    periods=3,freq='2H')

In [56]:
pr_2h

PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]')